In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
                   'key2': ['one', 'two', 'one', 'two', 'one'],
                   'data1': np.random.randn(5),
                   'data2': np.random.randn(5)})

df

  key1 key2     data1     data2
0    a  one -0.473573  0.965330
1    a  two -1.373602 -0.027680
2    b  one  1.304842  0.422324
3    b  two -1.116247 -1.443952
4    a  one  0.545950 -0.518921

Forma uno de agrupar

In [8]:
dfGrouped = df["data1"].groupby([df["key2"], df["key1"]]).count()
#dfGrouped = df.groupby(["key2", "key1"])["data1"].count()
dfGrouped

key2  key1
one   a       2
      b       1
two   a       1
      b       1
Name: data1, dtype: int64

Forma 2 de agrupar

In [3]:
df.groupby(["key2", "key1"]).sum()

              data1     data2
key2 key1
one  a     0.072377  0.446409
     b     1.304842  0.422324
two  a    -1.373602 -0.027680
     b    -1.116247 -1.443952

In [4]:
dfGrouped.unstack()

key1  a  b
key2
one   2  1
two   1  1

Iterar sobre agrupaciones

In [5]:
for name, group in df.groupby("key1"):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.473573  0.965330
1    a  two -1.373602 -0.027680
4    a  one  0.545950 -0.518921
b
  key1 key2     data1     data2
2    b  one  1.304842  0.422324
3    b  two -1.116247 -1.443952

Agrupamiento con diccionario

In [9]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people.iloc[2:3, [1, 2]] = np.nan  # Add a few NA values
people

               a         b         c         d         e
Joe     0.926264  0.623502  0.095446 -0.414563  1.643754
Steve  -0.244619  0.820409  0.230665 -0.926493  0.202305
Wes    -1.095453       NaN       NaN  0.714106 -0.319865
Jim     0.442883  0.533981  0.866081  0.167815  0.236234
Travis  0.784710 -0.407171  0.393495 -0.865574 -0.806852

In [10]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f': 'orange'}
people.groupby(mapping, axis=1).sum()

            blue       red
Joe    -0.319117  3.193521
Steve  -0.695828  0.778095
Wes     0.714106 -1.415318
Jim     1.033896  1.213099
Travis -0.472079 -0.429313

In [11]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.273695  1.157484  0.961527  0.467357  1.560124
5 -0.244619  0.820409  0.230665 -0.926493  0.202305
6  0.784710 -0.407171  0.393495 -0.865574 -0.806852